# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32
fusion_mode: bifpn
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MSRFD, [128]], # 0-P1/2
    [-1, 1, FDRFD, [128]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, FDRFD, [256]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, FDRFD, [512]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, FDRFD, [1024]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head
head:
  - [4, 1, Conv, [256]]  # 10-P3/8
  - [6, 1, Conv, [256]]  # 11-P4/16
  - [9, 1, Conv, [256]]  # 12-P5/32

  - [11, 1, Conv, [256, 3, 2]] # 13-P5/32
  - [[-1, 12], 1, Fusion, [fusion_mode]] # 14
  - [-1, 3, CSP_MSCB, [256, [3,5,7]]] # 15-P5/32

  - [-1, 1, EUCB, []] # 16-P4/16
  - [10, 1, Conv, [256, 3, 2]] # 17-P4/16
  - [[-1, -2, 11], 1, Fusion, [fusion_mode]] # 18
  - [-1, 3, CSP_MSCB, [256, [3,5,7]]] # 19-P4/16

  - [-1, 1, EUCB, []] # 20-P3/8
  - [2, 1, Conv, [256, 3, 2]] # 21-P3/8
  - [[-1, -2, 10], 1, Fusion, [fusion_mode]] # 22
  - [-1, 3, CSP_MSCB, [256, [3,5,7]]] # 23-P3/8

  - [[20, -1], 1, Fusion, [fusion_mode]] # 24
  - [-1, 3, CSP_MSCB, [256, [3,5,7]]] # 25-P3/8

  - [23, 1, Conv, [256, 3, 2]] # 26-P4/16
  - [25, 1, Conv, [256, 3, 2]] # 27-P4/16
  - [[-1, -2, 19, 16], 1, Fusion, [fusion_mode]] # 28-P4/16
  - [-1, 3, CSP_MSCB, [256, [3,5,7]]] # 29-P4/16

  - [19, 1, Conv, [256, 3, 2]] # 30-P5/32
  - [29, 1, Conv, [256, 3, 2]] # 31-P5/32
  - [[-1, -2, 15], 1, Fusion, [fusion_mode]] # 32-P5/32
  - [-1, 3, CSP_MSCB, [256, [3,5,7]]] # 33-P5/32

  - [[25, 29, 33], 1, Detect, [nc, anchors]] # Detect(P3, P4, P5)
