# Ultralytics YOLOv5 🚀, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32
fusion_mode: bifpn
# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, MSRFD, [128]], # 0-P1/2
    [-1, 1, FDRFD, [128]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, MutilScaleEdgeInfoGenetatorDSM, [[128, 256, 512]]], # 3
    [3, 1, GetIndexOutput, [0]], # 4-P3/8
    [3, 1, GetIndexOutput, [1]], # 5-P4/16
    [3, 1, GetIndexOutput, [2]], # 6-P5/32
     
    [2, 1, FDRFD, [256]], # 7-P3/8
    [-1, 6, C3, [256]],
    [[4, -1], 1, ConvEdgeFusion, [256]], # 9-P3/8
    [-1, 1, FDRFD, [512]], # 10-P4/16
    [-1, 9, C3, [512]],
    [[5, -1], 1, ConvEdgeFusion, [512]], # 12-P3/8
    [-1, 1, FDRFD, [1024]], # 13-P5/32
    [-1, 3, C3, [1024]],
    [[6, -1], 1, ConvEdgeFusion, [1024]], # 15-P3/8
    [-1, 1, SPPF, [1024, 5]], # 16
  ]

# YOLOv5 v6.0 head
head:
  - [8, 1, Conv, [256]]  # 17-P3/8
  - [11, 1, Conv, [256]]  # 18-P4/16
  - [16, 1, Conv, [256]]  # 19-P5/32

  - [18, 1, Conv, [256, 3, 2]] # 20-P5/32
  - [[-1, 19], 1, Fusion, [fusion_mode]] # 21
  - [-1, 3, CSP_MSCB, [256, [5,7,9]]] # 22-P5/32


  - [-1, 1, EUCB, []] # 23-P4/16
  - [17, 1, Conv, [256, 3, 2]] # 24-P4/16
  - [[-1, -2, 18], 1, Fusion, [fusion_mode]] # 25
  - [-1, 3, CSP_MSCB, [256, [3,5,7]]] # 26-P4/16


  - [-1, 1, EUCB, []] # 27-P3/8
  - [2, 1, Conv, [256, 3, 2]] # 28-P3/8
  - [[-1, -2, 17], 1, Fusion, [fusion_mode]] # 29
  - [-1, 3, CSP_MSCB, [256, [1,3,5]]] # 30-P3/8


  - [[27, -1], 1, Fusion, [fusion_mode]] # 31
  - [-1, 3, CSP_MSCB, [256, [1,3,5]]] # 32-P3/8


  - [30, 1, Conv, [256, 3, 2]] # 33-P4/16
  - [32, 1, Conv, [256, 3, 2]] # 34-P4/16
  - [[-1, -2, 26, 23], 1, Fusion, [fusion_mode]] # 35-P4/16
  - [-1, 3, CSP_MSCB, [256, [3,5,7]]] # 36-P4/16


  - [26, 1, Conv, [256, 3, 2]] # 37-P5/32
  - [36, 1, Conv, [256, 3, 2]] # 38-P5/32
  - [[-1, -2, 22], 1, Fusion, [fusion_mode]] # 39-P5/32
  - [-1, 3, CSP_MSCB, [256, [5,7,9]]] # 40-P5/32


  - [[32, 36, 40], 1, Detect, [nc, anchors]] # Detect(P3, P4, P5)
